assets/html/ecuh-pres.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>ECUH Info Session</title>
<meta name="author" content="(UH EE Student Advisory Board)"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/reveal.min.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/theme/beige.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>ECUH Info Session</h1>
<h2>UH EE Student Advisory Board</h2>
<h2><a href="mailto:uh-manoa-ee-sab-grp@hawaii.edu">uh-manoa-ee-sab-grp@hawaii.edu</a></h2>
<h2>2014-11-03</h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">What is the SAB?</a>
</li>
<li>
<a href="#sec-2">Accomplishments</a>
</li>
<li>
<a href="#sec-3">Membership opportunities</a>
</li>
<li>
<a href="#sec-4">Current Goals</a>
</li>
<li>
<a href="#sec-5">Contact Us</a>
</li>
</ul>
</section>

<section>
<section id="sec-1" >

<h2>What is the SAB?</h2>
<ul class="org-ul">
<li>An independent and fully student run committee 
</li>
<li>Represents the electrical engineering student body
</li>
<li>Supported by IEEE Student Branch at UH Manoa
</li>
</ul>

</section>
<section id="sec-1-1" >

<h3>How we got started</h3>
<ul class="org-ul">
<li>Created in 2001 under Dr. Anthony Kuh (EE Department Chair at the time) 
</li>
</ul>


<p>
Initial duties:
</p>

<ul class="org-ul">
<li>Provide student feedback required for ABET accreditation
</li>
<li>Present findings to Industry Advisory Board (IAB)
</li>
</ul>

</section>
<section id="sec-1-2" >

<h3>Commitment to student body</h3>
<ul class="org-ul">
<li>We represent the needs and concerns of the EE student body
</li>
<li>We provide a safe venue for students to raise concerns and comments
</li>
<li>We strive to make sure that EE students are receiving the most current education
</li>
</ul>
</section>

</section>
<section>
<section id="sec-2" >

<h2>Accomplishments</h2>
</section>
<section id="sec-2-1" >

<h3>Introduction of Custom EE Tracks</h3>
<ul class="org-ul">
<li>Electrical Enginering students are now allowed to create and propose custom curriculum tracks
</li>
<li>Allows students to stay on top of latest shifts in industry and technology
</li>
<li>Increases interdisciplinary connections
</li>
</ul>

</section>
<section id="sec-2-2" >

<h3>Engineering Breadth Expanded</h3>
<ul class="org-ul">
<li>Initially raised in 2001 by the first SAB committee
</li>
<li>Limited choices (CE270/ME311) expanded to all 300+ CEE/ME/OE/BE classes
</li>
<li>300+ phys/bio science courses also available for proposal
</li>
</ul>

</section>
<section id="sec-2-3" >

<h3>Payout of surplus fee monies</h3>
<ul class="org-ul">
<li>Worked in alliance with faculty to make use of surplus student fees (2012-2013)
</li>
<li>Invested in IEEE student room, improvements to EE student services in Holmes Hall
</li>
<li>Ordered industrial equipment otherwise unavailable to students
</li>
</ul>

</section>
<section id="sec-2-4" >

<h3>EE Student Project Lab (Holmes Hall 450)</h3>
<ul class="org-ul">
<li>Proposed by the 2013-2014 EE SAB
</li>
<li>Electrical engineering students have access to a dedicated student project lab (first time)
</li>
<li>Holmes Hall 450 now open for student signups
</li>
</ul>

</section>
<section id="sec-2-5" >

<h3>Open Letter to Dean</h3>
<ul class="org-ul">
<li><a href="http://www.kaleo.org/news/students-lose-stipends-to-financial-aid/article_d2127484-49bb-11e4-806c-001a4bcf6878.html?mode=print">Response to Financial Aid Office stipend policy</a>
</li>
<li>Potentially affects all students in stipend positions with the College
</li>
<li>Read about it here: <a href="http://www-ee.eng.hawaii.edu/~eesab/">http://www-ee.eng.hawaii.edu/~eesab/</a>
</li>
</ul>
</section>

</section>
<section>
<section id="sec-3" >

<h2>Membership opportunities</h2>
</section>
<section id="sec-3-1" >

<h3>Leadership</h3>
<ul class="org-ul">
<li>Practice leadership skills
</li>
<li>Address real student concerns
</li>
<li>Make lasting changes to student environment
</li>
</ul>

</section>
<section id="sec-3-2" >

<h3>Community Involvement</h3>
<ul class="org-ul">
<li>Helps maintain our community
</li>
<li>Created by students, for students
</li>
<li>Reach out to faculty and administration
</li>
</ul>

</section>
<section id="sec-3-3" >

<h3>Resume Building</h3>
<ul class="org-ul">
<li>SAB volunteer work is tangible and substantive
</li>
<li>Shows employers initiative and involvement
</li>
<li>A real engineering related extra-curricular activity
</li>
</ul>
</section>

</section>
<section>
<section id="sec-4" >

<h2>Current Goals</h2>
<ul class="org-ul">
<li>Improve our current website for more transparency
</li>
<li>Promote EE SAB; let students know they have a venue for concerns
</li>
<li>Become fully self-sustaining to continue to support students
</li>
</ul>
</section>

</section>
<section>
<section id="sec-5" >

<h2>Contact Us</h2>
<ul class="org-ul">
<li>website: <a href="http://www-ee.eng.hawaii.edu/~eesab/">http://www-ee.eng.hawaii.edu/~eesab/</a>
</li>
<li>github: <a href="https://github.com/IEEE-UH-Manoa/eesab-website/">https://github.com/IEEE-UH-Manoa/eesab-website/</a>
</li>
<li>email: uheesab@gmail.com
</li>
</ul>
</section>
</section>
</div>
</div>

<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/js/reveal.min.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'fade', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
]
});
</script>
</body>
</html>
